<?php

return [
    'location' => [
        'no_location_found' => 'Не удалось найти запись, соответствующую указанному короткому коду.',
        'ask_short' => 'Короткий код локации',
        'ask_long' => 'Описание локации',
        'created' => 'Новая локация (:name) успешно создана с ID :id.',
        'deleted' => 'Запрошенная локация успешно удалена.',
    ],
    'user' => [
        'search_users' => 'Введите имя пользователя, ID пользователя или адрес электронной почты',
        'select_search_user' => 'ID пользователя для удаления (введите \'0\', чтобы искать заново)',
        'deleted' => 'Пользователь успешно удалён из панели.',
        'confirm_delete' => 'Вы уверены, что хотите удалить этого пользователя из панели?',
        'no_users_found' => 'По указанному запросу пользователи не найдены.',
        'multiple_found' => 'Для указанного пользователя найдено несколько аккаунтов; удалить пользователя невозможно из-за флага --no-interaction.',
        'ask_admin' => 'Этот пользователь — администратор?',
        'ask_email' => 'Адрес электронной почты',
        'ask_username' => 'Имя пользователя',
        'ask_name_first' => 'Имя',
        'ask_name_last' => 'Фамилия',
        'ask_password' => 'Пароль',
        'ask_password_tip' => 'Если хотите создать аккаунт со случайным паролем, который будет отправлен пользователю по электронной почте, запустите эту команду заново (CTRL+C) и добавьте флаг `--no-password`.',
        'ask_password_help' => 'Пароль должен содержать не менее 8 символов, включая хотя бы одну заглавную букву и цифру.',
        '2fa_help_text' => [
            0 => 'Эта команда отключает двухфакторную аутентификацию в аккаунте пользователя, если она включена. Используйте её только для восстановления доступа, если пользователь не может войти в аккаунт.',
            1 => 'Если вы хотели сделать не это, нажмите CTRL+C, чтобы завершить процесс.',
        ],
        '2fa_disabled' => 'Двухфакторная аутентификация отключена для :email.',
    ],
    'schedule' => [
        'output_line' => 'Отправка задания для первой задачи в `:schedule` (:hash).',
    ],
    'maintenance' => [
        'deleting_service_backup' => 'Удаление файла резервной копии службы :file.',
    ],
    'server' => [
        'rebuild_failed' => 'Запрос на пересборку «:name» (#:id) на ноде «:node» завершился ошибкой: :message',
        'reinstall' => [
            'failed' => 'Запрос на переустановку «:name» (#:id) на ноде «:node» завершился ошибкой: :message',
            'confirm' => 'Вы собираетесь переустановить группу серверов. Продолжить?',
        ],
        'power' => [
            'confirm' => 'Вы собираетесь выполнить действие :action для серверов в количестве :count. Продолжить?',
            'action_failed' => 'Запрос на управление питанием «:name» (#:id) на ноде «:node» завершился ошибкой: :message',
        ],
    ],
    'environment' => [
        'mail' => [
            'ask_smtp_host' => 'SMTP-хост (например, smtp.gmail.com)',
            'ask_smtp_port' => 'SMTP-порт',
            'ask_smtp_username' => 'Имя пользователя SMTP',
            'ask_smtp_password' => 'Пароль SMTP',
            'ask_mailgun_domain' => 'Домен Mailgun',
            'ask_mailgun_endpoint' => 'Endpoint Mailgun',
            'ask_mailgun_secret' => 'Секрет Mailgun',
            'ask_mandrill_secret' => 'Секрет Mandrill',
            'ask_postmark_username' => 'API-ключ Postmark',
            'ask_driver' => 'Какой драйвер использовать для отправки писем?',
            'ask_mail_from' => 'Адрес электронной почты, от имени которого отправляются письма',
            'ask_mail_name' => 'Имя, от которого должны приходить письма',
            'ask_encryption' => 'Используемый метод шифрования',
        ],
    ],
];
