<?php

return [
    'gsl_token' => [
        'title' => 'Недействительный токен GSL!',
        'body_1' => 'Похоже, ваш Gameserver Login Token (токен GSL) недействителен или срок его действия истёк.',
        'body_2' => 'Вы можете создать новый и ввести его ниже либо оставить поле пустым, чтобы полностью удалить токен.',
        'field_label' => 'Токен GSL',
        'field_description' => 'Перейдите на https://steamcommunity.com/dev/managegameservers, чтобы создать токен.',
        'update_button' => 'Обновить токен GSL',
    ],
    'hytale_oauth' => [
        'title' => 'Требуется аутентификация',
        'body' => 'Чтобы скачивать или обновлять файлы сервера, нужно войти через аккаунт Hytale. Войдите, чтобы продолжить.',
        'cancel_button' => 'Отмена',
        'login_button' => 'Войти',
    ],
    'pid_limit' => [
        'admin_title' => 'Достигнут лимит памяти или процессов...',
        'admin_body_1' => 'Этот сервер достиг максимального лимита процессов или памяти.',
        'admin_body_2' => 'Увеличение <0>container_pid_limit</0> в конфигурации wings, <1>config.yml</1>, может помочь решить эту проблему.',
        'admin_note' => 'Примечание: чтобы изменения в файле конфигурации вступили в силу, необходимо перезапустить Wings',
        'user_title' => 'Возможно, достигнут лимит ресурсов...',
        'user_body' => 'Этот сервер пытается использовать больше ресурсов, чем выделено. Обратитесь к администратору и передайте ему ошибку ниже.',
        'close_button' => 'Закрыть',
    ],
    'steam_disk_space' => [
        'title' => 'Закончилось свободное место на диске...',
        'admin_body_1' => 'На этом сервере закончилось свободное место на диске, и он не может завершить установку или обновление.',
        'admin_body_2' => 'Убедитесь, что на машине достаточно места на диске, выполнив <0>df -h</0> на машине, где размещён этот сервер. Удалите файлы или увеличьте доступное место, чтобы решить проблему.',
        'user_body' => 'На этом сервере закончилось свободное место на диске, и он не может завершить установку или обновление. Свяжитесь с администратором(ами) и сообщите о проблеме с местом на диске.',
        'close_button' => 'Закрыть',
    ],
    'eula' => [
        'title' => 'Принять EULA Minecraft®',
        'body_prefix' => 'Нажимая «Принимаю» ниже, вы соглашаетесь с',
        'body_suffix' => '.',
        'link_text' => 'EULA Minecraft®',
        'cancel_button' => 'Отмена',
        'accept_button' => 'Принимаю',
    ],
    'java_version' => [
        'title' => 'Неподдерживаемая версия Java',
        'body' => 'Этот сервер использует неподдерживаемую версию Java и не может быть запущен.',
        'body_select_notice' => ' Выберите поддерживаемую версию из списка ниже, чтобы продолжить запуск сервера.',
        'cancel_button' => 'Отмена',
        'update_button' => 'Обновить Docker-образ',
    ],
];
