<?php

return [
    'title' => 'Пользователи',
    'empty' => 'Похоже, у вас нет субпользователей.',
    'new_user_button' => 'Новый пользователь',
    'row' => [
        'two_factor_label' => '2FA включена',
        'permissions_label' => 'Права',
        'edit_aria' => 'Изменить субпользователя',
    ],
    'edit_modal' => [
        'title_modify' => 'Изменить права для :email',
        'title_view' => 'Просмотр прав для :email',
        'title_create' => 'Создать нового субпользователя',
        'save_button' => 'Сохранить',
        'invite_button' => 'Пригласить пользователя',
        'permission_notice' => 'При создании или изменении других пользователей можно выбирать только те права, которые сейчас назначены вашему аккаунту.',
        'email_label' => 'Почта пользователя',
        'email_description' => 'Введите адрес почты пользователя, которого хотите пригласить как субпользователя этого сервера.',
        'validation' => [
            'email_max' => 'Адреса электронной почты не должны превышать 191 символ.',
            'email_invalid' => 'Необходимо указать действительный адрес электронной почты.',
        ],
    ],
    'remove' => [
        'title' => 'Удалить этого субпользователя?',
        'confirm_button' => 'Да, удалить субпользователя',
        'body' => 'Вы уверены, что хотите удалить этого субпользователя? Его доступ к этому серверу будет немедленно отозван.',
        'delete_aria' => 'Удалить субпользователя',
    ],
];
